# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Install Binaries
brew 'bash' # Bash 4
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'grep'
brew 'mas'
brew 'zsh'
brew 'zsh-completions'

# Development
brew 'node'

# Apps
cask 'iterm2'
cask 'sublime-text'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-fira-code'
cask 'font-lora'

# Install Mac App Store apps
mas 'The Unarchiver', id: 425424353
